back-end/app/controllers/api/v1/cves_controller.rb

        def save_remediation
          cve = CVE.find_by(cve_id: params[:id])
---
SELECT "cves".* FROM "cves" WHERE "cves"."cve_id" = $1 LIMIT $2  [["cve_id", "CVE-2024-36234"], ["LIMIT", 1]]

        def get_remediation
          cve = CVE.find_by(cve_id: params[:id])
---
SELECT "cves".* FROM "cves" WHERE "cves"."cve_id" = $1 LIMIT $2  [["cve_id", "CVE-2024-36234"], ["LIMIT", 1]]

        def show
          cve = CVE.find_by(cve_id: params[:id])
---
SELECT "cves".* FROM "cves" WHERE "cves"."cve_id" = $1 LIMIT $2  [["cve_id", "CVE-2024-36234"], ["LIMIT", 1]]

        def remediation_url
          cve = CVE.find_by(cve_id: params[:id])
---
SELECT "cves".* FROM "cves" WHERE "cves"."cve_id" = $1 LIMIT $2  [["cve_id", "CVE-2024-36234"], ["LIMIT", 1]]