back-end/app/controllers/api/v1/vendors_controller.rb

SELECT "vendors".* FROM "vendors"
---
      def index
        vendors = Vendor.all