back-end/app/services/fetch_cve_data_service.rb

INSERT INTO "vendors" ("name", "vendor_id", "created_at", "updated_at", "vendor_url") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Eyesofnetwork"], ["vendor_id", "16337"], ["created_at", "2024-07-02 17:40:01.025065"], ["updated_at", "2024-07-02 17:40:01.025065"], ["vendor_url", nil]]
SELECT "vendors".* FROM "vendors" WHERE "vendors"."vendor_id" = $1 LIMIT $2  [["vendor_id", "26"], ["LIMIT", 1]]
SELECT "cves".* FROM "cves" WHERE "cves"."cve_id" = $1 LIMIT $2  [["cve_id", "CVE-2024-38093"], ["LIMIT", 1]]
UPDATE "cves" SET "vendor_id" = $1, "assigner" = $2, "assigner_source_name" = $3, "cve_number" = $4, "cve_year" = $5, "publish_date" = $6, "update_date" = $7, "exploit_exists" = $8, "exploit_existence_change_date" = $9, "is_in_cisa_kev" = $10, "assigner_id" = $11, "nvd_vuln_status" = $12, "summary" = $13, "cisa_exploit_add" = $14, "cisa_vulnerability_name" = $15, "cisa_short_description" = $16, "epss_score" = $17, "epss_score_change_date" = $18, "epss_percentile" = $19, "config_count" = $20, "config_condition_count" = $21, "vendor_comment_count" = $22, "reference_count" = $23, "metric_count" = $24, "weakness_count" = $25, "max_cvss_base_score" = $26, "max_cvss_base_score_v3" = $27, "max_cvss_exploitability_score" = $28, "max_cvss_impact_score" = $29, "is_overflow" = $30, "is_memory_corruption" = $31, "is_sql_injection" = $32, "is_xss" = $33, "is_directory_traversal" = $34, "is_file_inclusion" = $35, "is_csrf" = $36, "is_xxe" = $37, "is_ssrf" = $38, "is_open_redirect" = $39, "is_input_validation" = $40, "is_code_execution" = $41, "is_bypass_something" = $42, "is_gain_privilege" = $43, "is_denial_of_service" = $44, "is_information_leak" = $45, "is_used_for_ransomware" = $46, "updated_at" = $47, "remediation_url" = $48 WHERE "cves"."id" = $49
---
  def self.call(vendor_name)
    url = "#{BASE_CVE_API_URL}&vendorName=#{vendor_name}&pageNumber=1&resultsPerPage=20"
    token = "f63628992e62f5d6ac84bdb1ab93025173ce4755.eyJzdWIiOjQ3MjUsImlhdCI6MTcxNzUyMzYzOSwiZXhwIjoxNzIyMzg0MDAwLCJraWQiOjEsImMiOiI3RCt3MkZoTnZDdFZNeFByWUFyM0dEdDlaVWZDNGhZcUNqOUVXU0t1M3owd080bFZ3dVQyTm04V3ZiUlNoSjFrRkk5SGNzTksifQ=="
    response = HTTParty.get(url, headers: { "Authorization" => "Bearer #{token}" })
    logo_response = HTTParty.get("#{BASE_LOGO_API_URL}#{vendor_name}", headers: { "X-Api-Key" => API_KEY })

    if response.success?
      response.parsed_response['results'].each do |vuln|
        vendor = Vendor.find_or_create_by(vendor_id: vuln['vendor_id']) do |v|
          if logo_response.success?
            logo_data = logo_response.parsed_response.first
            v.vendor_url = logo_data['image']
          end
          v.name = vuln['vendor']
          v.vendor_id = vuln['vendor_id']
        end


        CVE.find_or_create_by(cve_id: vuln['cveId']) do |cve|
          cve.update(
            vendor: vendor,
            assigner: vuln['assigner'],
            assigner_source_name: vuln['assignerSourceName'],
            cve_number: vuln['cveNumber'],
            cve_year: vuln['cveYear'],
            publish_date: vuln['publishDate'],
            update_date: vuln['updateDate'],
            exploit_exists: convert_to_boolean(vuln['exploitExists']),
            exploit_existence_change_date: vuln['exploitExistenceChangeDate'],
            is_in_cisa_kev: convert_to_boolean(vuln['isInCISAKEV']),
            assigner_id: vuln['assignerId'],
            nvd_vuln_status: vuln['nvdVulnStatus'],
            summary: vuln['summary'],
            evaluator_comment: vuln['evaluatorComment'],
            evaluator_solution: vuln['evaluatorSolution'],
            evaluator_impact: vuln['evaluatorImpact'],
            cisa_exploit_add: vuln['cisaExploitAdd'],
            cisa_action_due: vuln['cisaActionDue'],
            cisa_vulnerability_name: vuln['cisaVulnerabilityName'],
            cisa_required_action: vuln['cisaRequiredAction'],
            cisa_short_description: vuln['cisaShortDescription'],
            cisa_notes: vuln['cisaNotes'],
            epss_score: vuln['epssScore'],
            epss_score_change_date: vuln['epssScoreChangeDate'],