back-end/app/controllers/application_controller.rb

    def is_logged_in
        token = cookies.signed[:auth_token]
        logger.info("Auth token from cookies: #{token}")

        if token
            user = User.find_by(auth_token: token)
---
SELECT "users".* FROM "users" WHERE "users"."auth_token" = $1 LIMIT $2  [["auth_token", "[FILTERED]"], ["LIMIT", 1]]