back-end/app/controllers/api/v3/vendors_controller.rb

    def add_user
      user = current_user
      if user
        vendor = Vendor.find(params[:id])
        user.vendors << vendor unless user.vendors.include?(vendor)
---
SELECT "vendors".* FROM "vendors" WHERE "vendors"."id" = $1 LIMIT $2  [["id", 180], ["LIMIT", 1]]
SELECT "vendors".* FROM "vendors" INNER JOIN "users_vendors" ON "vendors"."id" = "users_vendors"."vendor_id" WHERE "users_vendors"."uid" = $1  [["uid", "wzc2"]]
SELECT 1 AS one FROM "vendors" INNER JOIN "users_vendors" ON "vendors"."id" = "users_vendors"."vendor_id" WHERE "users_vendors"."uid" = $1 AND "vendors"."id" = $2 LIMIT $3  [["uid", "wzc2"], ["id", 180], ["LIMIT", 1]]

    def remove_user
      user = current_user
      if user
        vendor = Vendor.find(params[:id])
---
SELECT "vendors".* FROM "vendors" WHERE "vendors"."id" = $1 LIMIT $2  [["id", 180], ["LIMIT", 1]]

    def authenticate_user!
      token = cookies.signed[:auth_token]
      @current_user = User.find_by(auth_token: token)
---
SELECT "users".* FROM "users" WHERE "users"."auth_token" = $1 LIMIT $2  [["auth_token", "[FILTERED]"], ["LIMIT", 1]]